#include<stdio.h>
int main(){
int N,k,i,j,sumMax=-1;  ///สร้าง sumMax มาเพื่อไว้ใช้หาค่าที่มากที่สุดของ sum ข้างล่าง
scanf("%d %d",&N,&k);   ///รับ N กับ k ตามโจทย์
int arr[N];             ///สร้าง array N ช่อง เช่น N เป็น 5 ก็จะสร้าง arr[5]
for(i=0;i<N;i++){       ///หมุนลูป N ครั้ง เพื่อใส่ค่าในแต่ละช่องของ arr โดยเริ่มจาก 0 หรือ arr[0]
    scanf("%d",&arr[i]);    /// จะเป็นการใส่ค่าให้ arr ในแต่ละช่อง ตามที่โจทย์ให้มา
}                       ///เมื่อจบบรรทัดนี้จะถือว่าใส่ค่าให้อาเรย์หมดทุกตัวแล้ว ต่อไปจะเป็นการคำนวน
for(i=0;i<N;i++){       ///หมุนลูป N ครั้ง เพราะเราจะไล่เช็คไปทีละตัวทุกตัวของ input เลย
    int sum=0;          ///สร้าง ตัวแปร sum มาเก็บผลรวม
    if(i-k<0){///กรณีที่ติดขอบซ้ายนั้น แสดงว่า i-K นั้นจะ<0 เช่น หากเริ่มเช็คที่ arr[0] แล้วขอบซ้ายจะเป็น 0-K ซึ่งยังไงก็ติดลบ
       for(j=0;j<=i+k;j++){///หมุนลูปตั้งแต่ 0 ไปจนถึง i+K
        sum+=arr[j];    ///เอาarr[j] ของแต่ละรอบมาบวกกันใน sum
        //printf("%d+",arr[j]); ถ้าอยากดูทีละขั้นให้เอา // ของบรรทัด 14,26,20,30 ออก
       }
    }
    else if(i+k>=N){///กรณีติดขอบขวา คือการที่i+K==N เพราะ i เราเริ่มที่ 0 ถ้า i+K แล้วเท่ากับNแสดงว่ามันเกินขอบเขตแล้ว
        for(j=i-k;j<N;j++){///หมุนลูปตั้งแต่ i-K หรือขอบเขตด้านซ้ายไปจนถึง N-1
            sum+=arr[j];    ///เอา arr[j] แต่ละรอบมาบวกกันใน sum
            //printf("%d+",arr[j]);
        }
    }
    else {  ///ถ้านอกเหนือกรณีข้างบนก็เหลือแต่แบบปกติที่ขอบเขตไปได้ทั้งซ้ายทั้งขวาไม่ชน
        for(j=i-k;j<=i+k;j++){  ///ก็ไล่บวกตั้งแต่ i-k ถึง i+K
            sum+=arr[j];
             //printf("%d+",arr[j]);
        }
    }
    if(sum>sumMax)sumMax=sum; ///ถ้ารอบไหน sum ที่บวกมันมากกว่า sumMax ก็ให้ขึ้นเป็น sumMax แทน
    //printf("\n");
}
printf("%d",sumMax);///ปริ้นท์ผลลัพธ์เป็นอันจบ


}
